#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#define number 30
int main()
{
    int i, j, k;
    int a[30];
    int map[number];
    for (i = 0; i < number; i++)
    {
        map[i] = -1;
    }
    j = 0;
    srand(time(NULL));
    while (j < 30)
    {
        k = rand() % 30;
        if (map[k] != -1)
            continue;
        map[k] = k;
        a[j] = k;
        j = j + 1;
    }
        static char a [30];
         a [1]='ÅíÀË',a [2]="ÀîÔ°½Ü",a [3]="¹ùöÎÁú",a [4]="Ö£Ê¤½Ü",a [5]="ÕÅÑï·«";
         a [6]="ÃÏÁú",a [7]="Áõ¿­ÁÖ",a [8]="Ö£×ÓºÀ",a [9]="ÍõÑå²©",a [10]="ÀîÖêæÃ";
         a [11]="»ªÖÒÔ­",a [12]="¹¨ÖÂÔ¶",a [13]="ÑîÖŞ",a [14]="Ì·Ìì",a [15]="³ÂË§";
         a [16]="ÈÎè´«h",a [17]="ÁõÀÖ¿ª",a [18]="³£Ğ¤Åô",a [19]="Áºîİº½",a [20]="³ÂÃ÷Ñş";
         a [21]="ËÎ½­Æ»",a [22]="Ö£»ªöÎ",a [23]="È½³Éè´",a [24]="ºÎÖ¾Ææ",a [25]="Íõ³Éè´";
         a [26]="·¶À¤",a [27]="½ğÈÊºÀ",a [28]="Ò¶º¹¶°",a [29]="³ÂÕş",a [30]="ÎºÀ×¿µ";
    for (i = 0; i < 30; i++)
    {
        if (i % 10 == 0)
        {
            printf("\n");
        }
        printf("%s ", a[i]);
    }
    return 0;
}