/*2. 题目：求出1000以内前20个不能被2,3,5,7整除的数之和
例如：数字17，不能被2,3,5,7进行整除（整除，即不能有余数），故17满足题意，再如数字15，不能被2,7整除，但能被3,5整除，故不满足题意。要求求出1000以内前20个满足不能被2,3,5,7整除的数的和*/
#include <stdio.h>
int main(void)
{
    int i, n, num, sum;
    sum = 0;
    num = 0;
    for (i = 0; i <= 1000; i++)
    {
        n = i;
        if ((n % 2 != 0) && (n % 3 != 0) && (n % 5 != 0) && (n % 7 != 0))
        {
            num = num + 1;
            if (num <= 20)
            {
                sum = sum + n;
                printf("%d ", n);
            }
        }
    }
    printf("\n sum is %d", sum);
    return 0;
}