/*12.9题目：输入某年某月某日，判断这一天是这一年的第几天？
程序分析：以3月5日为例，应该先把前两个月的加起来，然后再加上5天即本年的第几天，特殊情况，闰年且输入月份大于3时需考虑多加一天。*/
#include <stdio.h>
int main()
{
    int day, month, year, sum, i;
    int mon[12] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
    sum = 0;
    printf("请输入年、月、日，格式为：年,月,日（2015,12,10）\n");
    scanf("%d,%d,%d", &year, &month, &day); // 格式为：2015,12,10
    for (i = 0; i < month - 1; i++)
        sum += mon[i];
    sum += day;                                                           // 再加上某天的天数
    if (year % 400 == 0 || year % 4 == 0 && year % 100 != 0 && month > 2) // *如果是闰年且月份大于2,总天数应该加一天
        sum++;
    printf("这是这一年的第 %d 天。", sum);

    return 0;
}